In [10]:
import pandas as pd
import numpy as np

In [11]:
df=pd.read_csv('student.csv')

In [4]:
print(df.head())

     Name   Age  Gender Marks       City
0   Rahul  20.0    Male    85      Delhi
1   Priya  19.0  Female    92     Mumbai
2    Amit   NaN    Male    78  Bangalore
3   Sneha   NaN  Female    88    Chennai
4  Vikram  22.0    Male  Amit       Pune

In [12]:

print("\n Missing values:\n", df.isnull().sum())

 Missing values:
 Name      0
Age       2
Gender    0
Marks     0
City      0
dtype: int64

In [ ]:
print("\n Data description : \n", df.describe())

 Data description :
              Age
count   3.000000
mean   20.333333
std     1.527525
min    19.000000
25%    19.500000
50%    20.000000
75%    21.000000
max    22.000000

In [14]:
print("\n Data Info:\n")
print(df.info())

 Data Info:

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     3 non-null      float64
 2   Gender  5 non-null      object
 3   Marks   5 non-null      object
 4   City    5 non-null      object
dtypes: float64(1), object(4)
memory usage: 332.0+ bytes
None

In [15]:
df['Marks']=pd.to_numeric(df['Marks'],errors='coerce')

In [16]:
print(df)

     Name   Age  Gender  Marks       City
0   Rahul  20.0    Male   85.0      Delhi
1   Priya  19.0  Female   92.0     Mumbai
2    Amit   NaN    Male   78.0  Bangalore
3   Sneha   NaN  Female   88.0    Chennai
4  Vikram  22.0    Male    NaN       Pune

In [17]:
print("\n Converting Catergorical in number \n")

df= pd.get_dummies(df, columns=['City'], drop_first=True)

 Converting Catergorical in number

In [14]:
print(df.head())

     Name   Age  Gender  Marks  City_Chennai  City_Delhi  City_Mumbai  \
0   Rahul  20.0    Male   85.0         False        True        False
1   Priya  19.0  Female   92.0         False       False         True
2    Amit   NaN    Male   78.0         False       False        False
3   Sneha   NaN  Female   88.0          True       False        False
4  Vikram  22.0    Male    NaN         False       False        False

   City_Pune
0      False
1      False
2      False
3      False
4       True

In [15]:
df.min()

Name              Amit
Age               19.0
Gender          Female
Marks             78.0
City_Chennai     False
City_Delhi       False
City_Mumbai      False
City_Pune        False
dtype: object

In [16]:
df.head()

,Name,Age,Gender,Marks,City_Chennai,City_Delhi,City_Mumbai,City_Pune
0,Rahul,20.0,Male,85.0,False,True,False,False
1,Priya,19.0,Female,92.0,False,False,True,False
2,Amit,NaN,Male,78.0,False,False,False,False
3,Sneha,NaN,Female,88.0,True,False,False,False
4,Vikram,22.0,Male,NaN,False,False,False,True